#+title: Comparison git-svn and swh-svn
#+author: ardumont

* Comparison - 1

|------------+--------+------------------------------------------+-------------------------+---------------------------+-------------|
| Type       | # Revs | Url                                      | git-svn (git svn clone) | swh-svn (load repository) |       Ratio |
|------------+--------+------------------------------------------+-------------------------+---------------------------+-------------|
| small      |    145 | svn://svn.debian.org/svn/pkg-fox/        |                 447.074 |       1445.8084549359046s | 3.2339354 s |
| medium     |   6006 | svn://svn.debian.org/svn/glibc-bsd/      |                4740.928 |        10118.787201701081 |   2.1343474 |
| large      |  10707 | svn://svn.debian.org/svn/pkg-voip/       |                8592.398 |        46112.436119881924 |   5.3666551 |
| very large |  34523 | svn://svn.debian.org/svn/python-modules/ |               36627.907 |       288410.36918153404s | 7.8740609 s |
| very large |  48013 | svn://svn.debian.org/svn/pkg-gnome/      |               71902.080 |          594822.724728007 |   8.2726776 |
|------------+--------+------------------------------------------+-------------------------+---------------------------+-------------|
#+TBLFM: $6=$5/$4

Note:
- Time is in seconds
- We compare storing in our swh backend (swh-loader) and storing on
  disk (git-svn).

The git-svn clones, when it finishes goes faster.
But, it remains the swh loading in swh to do.

Below are the details about the extracted times.
Feel free to skip.

** Comparison

Here is the comparison with the following options:
#+BEGIN_SRC ini
# inhibit the swh-storage part
send_contents = False
send_directories = False
send_revisions = False
send_releases = False
send_occurrences = False

with_svn_update = False
with_revision_headers = False
with_empty_folder = False
with_extra_commit_line = True
#+END_SRC

|------------+--------+------------------------------------------+-------------------------+-------------------------------+------------|
| Type       | # Revs | Url                                      | git-svn (git svn clone) |                       swh-svn |      Ratio |
|------------+--------+------------------------------------------+-------------------------+-------------------------------+------------|
| small      |    145 | svn://svn.debian.org/svn/pkg-fox/        |                 447.074 |             547.6864733919501 |  1.2250466 |
| medium     |   6006 | svn://svn.debian.org/svn/glibc-bsd/      |                4740.928 |              4046.70439547766 | 0.85356799 |
| large      |  10707 | svn://svn.debian.org/svn/pkg-voip/       |                8592.398 |            28698.161668108776 |  3.3399479 |
| very large |  34523 | svn://svn.debian.org/svn/python-modules/ |               36627.907 | Lost result (something awful) |         0. |
| very large |  48013 | svn://svn.debian.org/svn/pkg-gnome/      |               71902.080 | Lost result (something awful) |         0. |
|------------+--------+------------------------------------------+-------------------------+-------------------------------+------------|
#+TBLFM: $6=$5/$4

** Comparison - no swh-storage

No swh-storage is used here.
Only write on disk and hash computations, then write result on logs (for swh-loader)

|------------+--------+------------------------------------------+-------------------------+----------------+--------------------+-------------|
| Type       | # Revs | Url                                      | git-svn (git svn clone) | # Revs updated |            swh-svn |       Ratio |
|------------+--------+------------------------------------------+-------------------------+----------------+--------------------+-------------|
| small      |    145 | svn://svn.debian.org/svn/pkg-fox/        |                 447.074 |            145 |  66.56195999495685 |  0.14888354 |
| medium     |   6006 | svn://svn.debian.org/svn/glibc-bsd/      |                4740.928 |           6073 | 338.06703379005194 | 0.071308198 |
| large      |  10707 | svn://svn.debian.org/svn/pkg-voip/       |                8592.398 |          10707 |  536.1971881072968 | 0.062403672 |
| very large |  34523 | svn://svn.debian.org/svn/python-modules/ |               36627.907 |          34523 |  3310.805134777911 | 0.090390235 |
| very large |  48013 | svn://svn.debian.org/svn/pkg-gnome/      |               71902.080 |          49061 | 3519.9480575090274 | 0.048954746 |
|------------+--------+------------------------------------------+-------------------------+----------------+--------------------+-------------|
#+TBLFM: $7=$6/$4

** comparison - with swh-storage

|------------+--------+------------------------------------------+-------------------------+----------------+--------------------+------------|
| Type       | # Revs | Url                                      | git-svn (git svn clone) | # Revs updated |            swh-svn |      Ratio |
|------------+--------+------------------------------------------+-------------------------+----------------+--------------------+------------|
| small      |    145 | svn://svn.debian.org/svn/pkg-fox/        |                 447.074 |            145 | 117.17479287087917 | 0.26209261 |
| medium     |   6006 | svn://svn.debian.org/svn/glibc-bsd/      |                4740.928 |           6073 |  962.4779040301219 | 0.20301466 |
| large      |  10707 | svn://svn.debian.org/svn/pkg-voip/       |                8592.398 |          10707 | 3028.8734963517636 | 0.35250619 |
| very large |  34523 | svn://svn.debian.org/svn/python-modules/ |               36627.907 |          34523 | 22651.265359937213 | 0.61841550 |
| very large |  48013 | svn://svn.debian.org/svn/pkg-gnome/      |               71902.080 |          49061 | 43629.105175915174 | 0.60678502 |
|------------+--------+------------------------------------------+-------------------------+----------------+--------------------+------------|
#+TBLFM: $7=$6/$4

